{
    "remaining_keywords": [],
    "analiced_ids": [
        "CVE-2021-22706",
        "CVE-2021-22821",
        "CVE-2024-43658",
        "CVE-2024-43656",
        "CVE-2024-43663",
        "CVE-2024-43648",
        "CVE-2021-22724",
        "CVE-2017-13108",
        "CVE-2021-22820",
        "CVE-2024-11666",
        "CVE-2024-43657",
        "CVE-2021-22730",
        "CVE-2021-47413",
        "CVE-2022-0878",
        "CVE-2017-6669",
        "CVE-2021-22727",
        "CVE-2020-8007",
        "CVE-2021-22707",
        "CVE-2025-27575",
        "CVE-2021-22729",
        "CVE-2024-43659",
        "CVE-2025-3426",
        "CVE-2025-31950",
        "CVE-2021-22726",
        "CVE-2024-43661",
        "CVE-2021-22773",
        "CVE-2024-43662",
        "CVE-2024-43652",
        "CVE-2021-22774",
        "CVE-2024-43654",
        "CVE-2021-22725",
        "CVE-2024-43650",
        "CVE-2021-22822",
        "CVE-2018-7778",
        "CVE-2024-43649",
        "CVE-2024-43660",
        "CVE-2023-3028",
        "CVE-2024-43651",
        "CVE-2010-0685",
        "CVE-2021-22818",
        "CVE-2020-8006",
        "CVE-2011-5145",
        "CVE-2021-22723",
        "CVE-2025-3019",
        "CVE-2025-27512",
        "CVE-2023-29114",
        "CVE-2023-37470",
        "CVE-2021-22721",
        "CVE-2024-43655",
        "CVE-2024-43653"
    ],
    "results": {
        "CVE-2017-13108": {
            "Date": "2017",
            "Source": "MITRE",
            "Title": "CVE-2017-13108",
            "URL": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-13108",
            "Description": "dfndr security antivirus, anti-hacking & cleaner, 5.0.9, 2017-11-01, android application uses a hard-coded key for encryption. data stored using this key can be decrypted by anyone able to access this key."
        },
        "CVE-2010-0685": {
            "Date": "2010",
            "Source": "NVD",
            "Title": "CVE-2010-0685",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2010-0685",
            "Description": "The design of the dialplan functionality in Asterisk Open Source 1.2.x, 1.4.x, and 1.6.x; and Asterisk Business Edition B.x.x and C.x.x, when using the ${EXTEN} channel variable and wildcard pattern matches, allows context-dependent attackers to inject strings into the dialplan using metacharacters that are injected when the variable is expanded, as demonstrated using the Dial application to process a crafted SIP INVITE message that adds an unintended outgoing channel leg.  NOTE: it could be argued that this is not a vulnerability in Asterisk, but a class of vulnerabilities that can occur in any program that uses this feature without the associated filtering functionality that is already available."
        },
        "CVE-2017-6669": {
            "Date": "2017",
            "Source": "NVD",
            "Title": "CVE-2017-6669",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-6669",
            "Description": "Multiple buffer overflow vulnerabilities exist in the Cisco WebEx Network Recording Player for Advanced Recording Format (ARF) files. An attacker could exploit these vulnerabilities by providing a user with a malicious ARF file via email or URL and convincing the user to launch the file. Exploitation of these vulnerabilities could cause an affected player to crash and, in some cases, could allow arbitrary code execution on the system of a targeted user. The Cisco WebEx Network Recording Player is an application that is used to play back WebEx meeting recordings that have been recorded on the computer of an online meeting attendee. The player can be automatically installed when the user accesses a recording file that is hosted on a WebEx server. The following client builds are affected by this vulnerability: Cisco WebEx Business Suite (WBS29) client builds prior to T29.13.130, Cisco WebEx Business Suite (WBS30) client builds prior to T30.17, Cisco WebEx Business Suite (WBS31) client builds prior to T31.10. Cisco Bug IDs: CSCvc47758 CSCvc51227 CSCvc51242."
        },
        "CVE-2023-3028": {
            "Date": "2023",
            "Source": "NVD",
            "Title": "CVE-2023-3028",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2023-3028",
            "Description": "Insufficient authentication in the MQTT backend (broker) allows an attacker to access and even manipulate the telemetry data of the entire fleet of vehicles using the HopeChart HQT-401 telematics unit. Other models are possibly affected too.\n\n\n\n\n\n\n\n\nMultiple vulnerabilities were identified:\n\n\n\n- The MQTT backend does not require authentication, allowing unauthorized connections from an attacker.\n\n\n\n- The vehicles publish their telemetry data (e.g. GPS Location, speed, odometer, fuel, etc) as messages in public topics. The backend also sends commands to the vehicles as MQTT posts in public topics. As a result, an attacker can access the confidential data of the entire fleet that is managed by the backend.\n\n\n\n- The MQTT messages sent by the vehicles or the backend are not encrypted or authenticated. An attacker can create and post messages to impersonate a vehicle or the backend. The attacker could then, for example, send incorrect information to the backend about the vehicle's location.\n\n\n\n- The backend can inject data into a vehicle´s CAN bus by sending a specific MQTT message on a public topic. Because these messages are not authenticated or encrypted, an attacker could impersonate the backend, create a fake message and inject CAN data in any vehicle managed by the backend.\n\n\nThe confirmed version is 201808021036, however further versions have been also identified as potentially impacted.\n\n\n\n"
        },
        "CVE-2023-37470": {
            "Date": "2023",
            "Source": "NVD",
            "Title": "CVE-2023-37470",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2023-37470",
            "Description": "Metabase is an open-source business intelligence and analytics platform. Prior to versions 0.43.7.3, 0.44.7.3, 0.45.4.3, 0.46.6.4, 1.43.7.3, 1.44.7.3, 1.45.4.3, and 1.46.6.4, a vulnerability could potentially allow remote code execution on one's Metabase server. The core issue is that one of the supported data warehouses (an embedded in-memory database H2), exposes a number of ways for a connection string to include code that is then executed by the process running the embedded database. Because Metabase allows users to connect to databases, this means that a user supplied string can be used to inject executable code. Metabase allows users to validate their connection string before adding a database (including on setup), and this validation API was the primary vector used as it can be called without validation. Versions 0.43.7.3, 0.44.7.3, 0.45.4.3, 0.46.6.4, 1.43.7.3, 1.44.7.3, 1.45.4.3, and 1.46.6.4 fix this issue by removing the ability of users to add H2 databases entirely. As a workaround, it is possible to block these vulnerabilities at the network level by blocking the endpoints `POST /api/database`, `PUT /api/database/:id`, and `POST /api/setup/validateuntil`. Those who use H2 as a file-based database should migrate to SQLite."
        },
        "CVE-2025-3019": {
            "Date": "2025",
            "Source": "NVD",
            "Title": "CVE-2025-3019",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2025-3019",
            "Description": "KNIME Business Hub is affected by several cross-site scripting vulnerabilities in its web pages. If a user clicks on a malicious link or opens a malicious web page, arbitrary Java Script may be executed with this user's permissions. This can lead to information loss and/or modification of existing data.\nThe issues are caused by a  bug https://github.com/Baroshem/nuxt-security/issues/610  in the widely used nuxt-security module.\n\n\n\n\n\nThere are no viable workarounds therefore we strongly recommend to update to one of the following versions of KNIME Business Hub:\n\n\n\n\n\n  *  1.13.3 or later\n\n\n\n\n\n\n  *  1.12.4 or later"
        },
        "CVE-2025-3426": {
            "Date": "2025",
            "Source": "NVD",
            "Title": "CVE-2025-3426",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2025-3426",
            "Description": "We observed that Intellispace Portal binaries doesn’t have any protection mechanisms to prevent reverse engineering. Specifically, the app’s code is not obfuscated, and no measures are in place to protect against decompilation, disassembly, or debugging. As a result, attackers can reverse-engineer the application to gain insights into its internal workings, which can potentially lead to the discovery of sensitive information, business logic flaws, and other vulnerabilities.\nUtilizing this flaw, the attacker was able to identify the Hardcoded credentials from PortalUsersDatabase.dll, which contains .NET remoting definition. Inside the namespace PortalUsersDatabase, the class Users contains the functions CreateAdmin and CreateService that are used to initialize accounts in the Portal service. Both CreateAdmin and CreateService functions contain a hardcoded encrypted password along with its respective salt that are set with the function SetInitialPasswordAndSalt.\nThis issue affects IntelliSpace Portal: 12 and prior; Advanced Visualization Workspace: 15."
        },
        "CVE-2025-27512": {
            "Date": "2025",
            "Source": "MITRE",
            "Title": "CVE-2025-27512",
            "URL": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-27512",
            "Description": "zincati is an auto-update agent for fedora coreos hosts. zincati ships a polkit rule which allows the `zincati` system user to use the actions `org.projectatomic.rpmostree1.deploy` to deploy updates to the system and `org.projectatomic.rpmostree1.finalize-deployment` to reboot the system into the deployed update. since zincati v0.0.24, this polkit rule contains a logic error which broadens access of those polkit actions to any unprivileged user rather than just the `zincati` system user. in practice, this means that any unprivileged user with access to the system d-bus socket is able to deploy older fedora coreos versions (which may have other known vulnerabilities). note that rpm-ostree enforces that the selected version must be from the same branch the system is currently on so this cannot directly be used to deploy an attacker-controlled update payload. this primarily impacts users running untrusted workloads with access to the system d-bus socket. note that in general, untrusted workloads should not be given this access, whether containerized or not. by default, containers do not have access to the system d-bus socket. the logic error is fixed in zincati v0.0.30. a workaround is to manually add a following polkit rule, instructions for which are available in the github security advisory."
        },
        "CVE-2021-22820": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22820",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22820",
            "Description": "A CWE-614 Insufficient Session Expiration vulnerability exists that could allow an attacker to maintain an unauthorized access over a hijacked session to the charger station web server even after the legitimate user account holder has changed his password. Affected Products: EVlink City EVC1S22P4 / EVC1S7P4 (All versions prior to R8 V3.4.0.2 ), EVlink Parking EVW2 / EVF2 / EVP2PE (All versions prior to R8 V3.4.0.2), and EVlink Smart Wallbox EVB1A (All versions prior to R8 V3.4.0.2)"
        },
        "CVE-2021-47413": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-47413",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-47413",
            "Description": "In the Linux kernel, the following vulnerability has been resolved:\n\nusb: chipidea: ci_hdrc_imx: Also search for 'phys' phandle\n\nWhen passing 'phys' in the devicetree to describe the USB PHY phandle\n(which is the recommended way according to\nDocumentation/devicetree/bindings/usb/ci-hdrc-usb2.txt) the\nfollowing NULL pointer dereference is observed on i.MX7 and i.MX8MM:\n\n[    1.489344] Unable to handle kernel NULL pointer dereference at virtual address 0000000000000098\n[    1.498170] Mem abort info:\n[    1.500966]   ESR = 0x96000044\n[    1.504030]   EC = 0x25: DABT (current EL), IL = 32 bits\n[    1.509356]   SET = 0, FnV = 0\n[    1.512416]   EA = 0, S1PTW = 0\n[    1.515569]   FSC = 0x04: level 0 translation fault\n[    1.520458] Data abort info:\n[    1.523349]   ISV = 0, ISS = 0x00000044\n[    1.527196]   CM = 0, WnR = 1\n[    1.530176] [0000000000000098] user address but active_mm is swapper\n[    1.536544] Internal error: Oops: 96000044 [#1] PREEMPT SMP\n[    1.542125] Modules linked in:\n[    1.545190] CPU: 3 PID: 7 Comm: kworker/u8:0 Not tainted 5.14.0-dirty #3\n[    1.551901] Hardware name: Kontron i.MX8MM N801X S (DT)\n[    1.557133] Workqueue: events_unbound deferred_probe_work_func\n[    1.562984] pstate: 80000005 (Nzcv daif -PAN -UAO -TCO BTYPE=--)\n[    1.568998] pc : imx7d_charger_detection+0x3f0/0x510\n[    1.573973] lr : imx7d_charger_detection+0x22c/0x510\n\nThis happens because the charger functions check for the phy presence\ninside the imx_usbmisc_data structure (data->usb_phy), but the chipidea\ncore populates the usb_phy passed via 'phys' inside 'struct ci_hdrc'\n(ci->usb_phy) instead.\n\nThis causes the NULL pointer dereference inside imx7d_charger_detection().\n\nFix it by also searching for 'phys' in case 'fsl,usbphy' is not found.\n\nTested on a imx7s-warp board."
        },
        "CVE-2023-29114": {
            "Date": "2023",
            "Source": "NVD",
            "Title": "CVE-2023-29114",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2023-29114",
            "Description": "System logs could be accessed through web management application due to a lack of access control.\n\n\nAn attacker can obtain the following sensitive information:\n\n•     Wi-Fi access point credentials to which the EV charger can connect.\n\n•     APN web address and credentials.\n\n•     IPSEC credentials.\n\n•     Web interface access credentials for user and admin accounts.\n\n•     JuiceBox system components (software installed, model, firmware version, etc.).\n\n•     C2G configuration details.\n\n•     Internal IP addresses.\n\n•     OTA firmware update configurations (DNS servers).\n\nAll the credentials are stored in logs in an unencrypted plaintext format."
        },
        "CVE-2020-8007": {
            "Date": "2020",
            "Source": "NVD",
            "Title": "CVE-2020-8007",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2020-8007",
            "Description": "The pwrstudio web application of EV Charger (in the server in Circontrol Raption through 5.6.2) is vulnerable to OS command injection via three fields of the configuration menu for ntpserver0, ntpserver1, and pingip."
        },
        "CVE-2024-11666": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-11666",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-11666",
            "Description": "Affected devices beacon to eCharge cloud infrastructure asking if there are any command they should run. This communication is established over an insecure channel since peer verification is disabled everywhere. Therefore, remote unauthenticated users  suitably positioned on the network between an EV charger controller and eCharge infrastructure can execute arbitrary commands with elevated privileges on affected devices.\n\nThis issue affects cph2_echarge_firmware: through 2.0.4."
        },
        "CVE-2024-43648": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43648",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43648",
            "Description": "Command injection in the <redacted> parameter of a <redacted>.exe request leads to remote code execution as the root user.\n\nThis issue affects Iocharger firmware for AC models before version 24120701.\n\nLikelihood: Moderate – This action is not a common place for command injection vulnerabilities to occur. Thus, an attacker will likely only be able to find this vulnerability by reverse-engineering the firmware or trying it on all <redacted> fields. The attacker will also need a (low privilege) account to gain access to the <redacted> binary, or convince a user with such access to execute a payload.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and delete files and services.\n\nCVSS clarification. The attack can be executed over any network connection the station is listening to and serves the web interface (AV:N), and there are no additional security measure sin place that need to be circumvented (AC:L), the attack does not rely on preconditions (AT:N). The attack does require authentication, but the level of authentication is irrelevant (PR:L), it does not require user interaction (UI:N). If is a full system compromise, potentially fully compromising confidentiality, integrity and availability of the devicer (VC:H/VI:H/VA:H).  A compromised charger can be used to \"pivot\" onto networks that should otherwise be closed, cause a low confidentiality and interity impact on subsequent systems. (SC:L/SI:L/SA:H). Because this device is an EV charger handing significant amounts of power, we suspect this vulnerability can have a safety impact (S:P). The attack can be automated (AU:Y)."
        },
        "CVE-2024-43649": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43649",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43649",
            "Description": "Authenticated command injection in the filename of a <redacted>.exe request leads to remote code execution as the root user.\n\nThis issue affects Iocharger firmware for AC models before version 24120701.\n\nLikelihood: Moderate – This action is not a common place for command injection vulnerabilities to occur. Thus, an attacker will likely only be able to find this vulnerability by reverse-engineering the firmware or trying it on all <redacted> fields. The attacker will also need a (low privilege) account to gain access to the <redacted> binary, or convince a user with such access to execute a payload.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and delete files and services.\n\nCVSS clarification: This attack can be performed over any network conenction serving the web interfacr (AV:N), and there are not additional mitigating measures that need to be circumvented (AC:L) or other prerequisites (AT:N). The attack does require privileges, but the level does not matter (PR:L), there is no user interaction required (UI:N). The attack leeds to a full compromised of the charger (VC:H/VI:H/VA:H) and a compromised charger can be used to \"pivot\" to networks that should normally not be reachable (SC:L/SI:L/SA:H). Because this is an EV chargers with significant pwoer, there is a potential safety imp0act (S:P). THis attack can be automated (AU:Y)."
        },
        "CVE-2024-43650": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43650",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43650",
            "Description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability in Iocharger firmware for AC models allows OS Command Injection as root\n\nThis issue affects  firmware versions before 24120701.\n\nLikelihood: Moderate – The <redacted> binary does not seem to be used by the web interface, so it might be more difficult to find. It seems to be largely the same binary as used by the Iocharger Pedestal charging station, however. The attacker will also need a (low privilege) account to gain access to the <redacted> binary, or convince a user with such access to execute a crafted HTTP request.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and delete\nfiles and services.\n\nCVSS clarification: The attack can be executed over any network connection serving the web interface (AV:N). There are no additional measures that need to be circumvented (AC:L) or attack preconditions (AT:N). THe attack is privileged, but the level does not matter (PR:L) and does not require user interaction (UI:N). Attack leads to full system compromised (VC:H/VI:H/VA:H) and compromised devices can be used to \"pivot\" to other networks that should be unreachable (SC:L/SI:L/SA:H). Because this an EV charger using high power, there is a potential safety impact (S:P). The attack can be automated (AU:Y)."
        },
        "CVE-2024-43651": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43651",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43651",
            "Description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability allows OS Command Injection as root\nThis issue affects Iocharger firmware for AC models before version 241207101\n\nLikelihood: Moderate – The <redacted> binary does not seem to be used by the web interface, so it might be more difficult to find. It seems to be largely the same binary as used by the Iocharger Pedestal charging station, however. The attacker will also need a (low privilege) account to gain access to the <redacted> binary, or convince a user with such access to execute a crafted HTTP request.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and delete files and services.\n\nCVSS clarification: Any network connection serving the web interface is vulnerable (AV:N) and there are no additional measures to circumvent (AC:L) nor does the attack require special conditions to be present (AT:N). The attack requires authentication, but the level does not matter (PR:L), nor is user interaction required (UI:N). The attack leads to a full compromised (VC:H/VI:H/VA:H) and a compromised device can be used to potentially \"pivot\" into a network that should nopt be reachable (SC:L/SI:L/SA:H). Because this is an EV charger handing significant power, there is a potential safety impact (S:P). THe attack can be autometed (AU:Y)."
        },
        "CVE-2024-43653": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43653",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43653",
            "Description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability  allows OS Command Injection as root\nThis issue affects Iocharger firmware for AC model chargers before version 24120701.\n\nLikelihood: Moderate – The <redacted> binary does not seem to be used by the web interface, so it might be more difficult to find. It seems to be largely the same binary as used by the Iocharger Pedestal charging station, however. The attacker will also need a (low privilege) account to gain access to the <redacted> binary, or convince a user with such access to execute a crafted HTTP request.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and delete\nfiles and services.\n\nCVSS clarification: Any network interface serving the web ui is vulnerable (AV:N) and there are not additional security measures to circumvent (AC:L), nor does the attack require and existing preconditions (AT:N). The attack is authenticated, but the level of authentication does not matter (PR:L), nor is any user interaction required (UI:N). The attack leads to a full compromised (VC:H/VI:H/VA:H), and compromised devices can be used to pivot into networks that should potentially not be accessible (SC:L/SI:L/SA:H). Becuase this is an EV charger handing significant power, there is a potential safety impact (S:P). This attack can be automated (AU:Y)."
        },
        "CVE-2024-43654": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43654",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43654",
            "Description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability in Iocharger  firmware for AC models allows OS Command Injection as root\nThis issue affects all Iocharger AC EV charger models on a firmware version before 25010801.\n\nLikelihood: Moderate – The <redacted> binary does not seem to be used by the web interface, so it might be more difficult to find. It seems to be largely the same binary as used by the Iocharger Pedestal charging station, however. The attacker will also need a (low privilege) account to gain access to the <redacted> binary, or convince a user with such access to execute a crafted HTTP request.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and delete\nfiles and services.\n\nCVSS clarification: Any network interface serving the web ui is vulnerable (AV:N) and there are not additional security measures to circumvent (AC:L), nor does the attack require and existing preconditions (AT:N). The attack is authenticated, but the level of authentication does not matter (PR:L), nor is any user interaction required (UI:N). The attack leads to a full compromised (VC:H/VI:H/VA:H), and compromised devices can be used to pivot into networks that should potentially not be accessible (SC:L/SI:L/SA:H). Becuase this is an EV charger handing significant power, there is a potential safety impact (S:P). This attack can be automated (AU:Y)."
        },
        "CVE-2024-43655": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43655",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43655",
            "Description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability allows OS Command Injection as root\n\nThis issue affects Iocharger firmware for AC model chargers before version 24120701.\n\nLikelihood: Moderate – The attacker will first need to find the name of the script, and needs a (low privilege) account to gain access to the script, or convince a user with such access to execute a request to it.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and deletefiles and services.\n\nCVSS clarification: Any network interface serving the web ui is vulnerable (AV:N) and there are not additional security measures to circumvent (AC:L), nor does the attack require and existing preconditions (AT:N). The attack is authenticated, but the level of authentication does not matter (PR:L), nor is any user interaction required (UI:N). The attack leads to a full compromised (VC:H/VI:H/VA:H), and compromised devices can be used to pivot into networks that should potentially not be accessible (SC:L/SI:L/SA:H). Becuase this is an EV charger handing significant power, there is a potential safety impact (S:P). This attack can be automated (AU:Y)."
        },
        "CVE-2024-43656": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43656",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43656",
            "Description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability allows OS Command Injection as root\n\nThis issue affects Iocharger firmware for AC model chargers before version 24120701.\n\nLikelihood: Moderate – It might be difficult for an attacker to identify the file structure of the <redated> directory, and then modify the backup to add a new CGI script in the correct directory. Furthermore, the attacker will need an account to restore the settings backup, or convince a user with such access to upload a modified backup file.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and deletefiles and services.\n\nCVSS clarification: Any network interface serving the web ui is vulnerable (AV:N) and there are not additional security measures to circumvent (AC:L), nor does the attack require and existing preconditions (AT:N). The attack is authenticated, but the level of authentication does not matter (PR:L), nor is any user interaction required (UI:N). The attack leads to a full compromised (VC:H/VI:H/VA:H), and compromised devices can be used to pivot into networks that should potentially not be accessible (SC:L/SI:L/SA:H). Becuase this is an EV charger handing significant power, there is a potential safety impact (S:P). This attack can be automated (AU:Y)."
        },
        "CVE-2024-43657": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43657",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43657",
            "Description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability allows OS Command Injection as root\n\nThis issue affects Iocharger firmware for AC model chargers before version 24120701.\n\nLikelihood: High. However, the attacker will need a (low privilege) account to gain access to the action.exe CGI binary and upload the crafted firmware file, or convince a user with such access to upload it.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and deletefiles and services.\n\nCVSS clarification: Any network interface serving the web ui is vulnerable (AV:N) and there are not additional security measures to circumvent (AC:L), nor does the attack require and existing preconditions (AT:N). The attack is authenticated, but the level of authentication does not matter (PR:L), nor is any user interaction required (UI:N). The attack leads to a full compromised (VC:H/VI:H/VA:H), and compromised devices can be used to pivot into networks that should potentially not be accessible (SC:L/SI:L/SA:H). Becuase this is an EV charger handing significant power, there is a potential safety impact (S:P). This attack can be automated (AU:Y)."
        },
        "CVE-2024-43659": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43659",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43659",
            "Description": "After gaining access to the firmware of a charging station, a file at <redacted> can be accessed to obtain default credentials that are the same across all Iocharger AC model EV chargers.\n\nThis issue affects Iocharger firmware for AC models before firmware version 25010801. \n\nThe issue is addressed by requiring a mandatory password change on first login, it is still recommended to change the password on older models.\n\nLikelihood: Moderate – The attacker will first have to abuse a code execution or file inclusion vulnerability (for example by using <redacted>.sh) to gain access to the <redacted>.json file, or obtain a firmware dump of the charging station or obtain the firmware via other channels.\n\nImpact: Critical – All chargers using Iocharger firmware for AC models started with the same initial password. For models with firmware version before 25010801 a password change was not mandatory. It is therefore very likely that this firmware password is still active on many chargers. These credentials could, once obtained, allow an attacker to log into many Iocharger charging station, and allow them to execute arbitrary commands via the System → Custom page.\n\nCVSS clarification: Any network interface serving the web ui is vulnerable (AV:N) and there are not additional security measures to circumvent (AC:L), nor does the attack require and existing preconditions (AT:N). The attack is authenticated, and requires high privileges (PR:H), there is no user interaction required (UI:N). The attack leads to a compromised of the confidentialy of the \"super user\" credentials of the device (VC:H/VI:N/VA:N), and can subsequently be used to full compromise and other devices (SC:H/SI:H/SA:H). Becuase this is an EV charger handing significant power, there is a potential safety impact (S:P). This attack can be automated (AU:Y)."
        },
        "CVE-2024-43660": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43660",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43660",
            "Description": "The CGI script <redacted>.sh can be used to download any file on the filesystem.\n\nThis issue affects Iocharger firmware for AC model chargers beforeversion 24120701.\n\nLikelihood: High, but credentials required.\n\nImpact: Critical – The script can be used to download any file on the filesystem, including sensitive files such as /etc/shadow, the CGI script source code or binaries and configuration files.\n\nCVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N/S:P/AU:Y\nCVSS clarification. The attack can be executed over any network connection the station is listening to and serves the web interface (AV:N), and there are no additional security measure sin place that need to be circumvented (AC:L), the attack does not rely on preconditions (AT:N). The attack does require authentication, but the level of authentication is irrelevant (PR:L), it does not require user interaction (UI:N). The confidentiality of all files of the devicd can be compromised (VC:H/VI:N/VA:N).  There is no impact on subsequent systems. (SC:N/SI:N/SA:N). While this device is an EV charger handing significant amounts of power, this attack in isolation does not have a safety impact. The attack can be automated (AU:Y)."
        },
        "CVE-2024-43661": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43661",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43661",
            "Description": "The <redacted>.so library, which is used by <redacted>, is\nvulnerable to a buffer overflow in the code that handles the deletion\nof certificates. This buffer overflow can be triggered by providing a\nlong file path to the <redacted> action of the <redacted>.exe CGI binary or\nto the <redacted>.sh CGI script. This binary or script will write this\nfile path to <redacted>, which is then\nread by <redacted>.so\n\n\nThis issue affects Iocharger firmware for AC models before version 24120701.\n\nLikelihood: Moderate – An attacker will have to find this exploit by\neither obtaining the binaries involved in this vulnerability, or by trial\nand error. Furthermore, the attacker will need a (low privilege)\naccount to gain access to the <redacted>.exe CGI binary or <redacted>.sh\nscript to trigger the vulnerability, or convince a user with such access\nsend an HTTP request that triggers it.\n\n\nImpact: High – The <redacted> process, which we assume is\nresponsible for OCPP communication, will keep crashing after\nperforming the exploit. This happens because the buffer overflow\ncauses the process to segfault before\n<redacted> is removed. This means that,\neven though <redacted> is automatically restarted, it will crash\nagain as soon as it tries to parse the text file.\n\nCVSS clarification. The attack can be executed over any network connection the station is listening to and serves the web interface (AV:N), and there are no additional security measure sin place that need to be circumvented (AC:L), the attack does not rely on preconditions (AT:N). The attack does require authentication, but the level of authentication is irrelevant (PR:L), it does not require user interaction (UI:N). The attack leads to reducred availability of the device (VC:N/VI:N/VA:H). THere is not impact on subsequent systems. (SC:N/SI:N/SA:N). Alltough this device is an EV charger handing significant amounts of power, we do not forsee a safety impact. The attack can be automated (AU:Y). Because the DoS condition is written to disk persistantly, it cannot be recovered by the user (R:I)."
        },
        "CVE-2024-43662": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43662",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43662",
            "Description": "The <redacted>.exe or <redacted>.exe CGI binary can be used to upload arbitrary files to /tmp/upload/ or /tmp/ respectively as any user, although the user interface for uploading files is only shown to the iocadmin user.\n\nThis issue affects Iocharger firmware for AC models before version 24120701.\n\nLikelihood: Moderate – An attacker will need to have knowledge of this CGI binary, e.g. by finding it in firmware. Furthermore, the attacker will need a (low privilege) account to gain access to the <redacted>.exe or <redacted>.exe CGI binary and upload the file, or convince a user with such access to upload it.\n\nImpact: Low – The attacker can upload arbitrary files to /tmp/upload/ or /tmp/. However, the attacker is unable to access or use these files without other vulnerabilities.\n\nCVSS clarification. The attack can be executed over any network connection the station is listening to and serves the web interface (AV:N), and there are no additional security measure sin place that need to be circumvented (AC:L), the attack does not rely on preconditions (AT:N). The attack does require authentication, but the level of authentication is irrelevant (PR:L), it does not require user interaction (UI:N). Artitrary files can be uploaded, be these files will not be in a location where they can influence confidentiality or availability and have a minimal impact on device integrity (VC:N/VI:L/VA:N).  There is no impact on subsequent systems. (SC:N/SI:N/SA:N). While this device is an EV charger handing significant amounts of power, we do not expect this vulnerability to have a safety impact. The attack can be automated (AU:Y)."
        },
        "CVE-2024-43663": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43663",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43663",
            "Description": "There are many buffer overflow vulnerabilities present in several CGI binaries of the charging station.This issue affects Iocharger firmware for AC model chargers beforeversion 24120701.\n\nLikelihood: High – Given the prevalence of these buffer overflows, and the clear error message of the web server, an attacker is very likely to be able to find these vulnerabilities.\n\nImpact: Low – Usually, overflowing one of these buffers just causes a segmentation fault of the CGI binary, which causes the web server to return a 502 Bad Gateway error. However the webserver itself is not affected, and no DoS can be achieved. Abusing these buffer overflows in a meaningful way requires highly technical knowledge, especially since ASLR also seems to be enabled on the charging station. However, a skilled attacker might be able to use one of these buffer overflows to obtain remote code execution.\n\nCVSS clarification. The attack can be executed over any network connection the station is listening to and serves the web interface (AV:N), and there are no additional security measure sin place that need to be circumvented (AC:L), the attack does not rely on preconditions (AT:N). The attack does require authentication, but the level of authentication is irrelevant (PR:L), it does not require user interaction (UI:N). The attack has a small impact on the availability of the device (VC:N/VI:N/VA:L).  There is no impact on subsequent systems. (SC:N/SI:N/SA:N). While this device is an EV charger handing significant amounts of power, we do not expect  this vulnerability to have a safety impact. The attack can be automated (AU:Y)."
        },
        "CVE-2025-27575": {
            "Date": "2025",
            "Source": "NVD",
            "Title": "CVE-2025-27575",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2025-27575",
            "Description": "An unauthenticated attacker can obtain EV charger version and firmware upgrading history by knowing the charger ID."
        },
        "CVE-2025-31950": {
            "Date": "2025",
            "Source": "MITRE",
            "Title": "CVE-2025-31950",
            "URL": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-31950",
            "Description": "an unauthenticated attacker can obtain ev charger energy consumption information of other users."
        },
        "CVE-2022-0878": {
            "Date": "2022",
            "Source": "MITRE",
            "Title": "CVE-2022-0878",
            "URL": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-0878",
            "Description": "electric vehicle (ev) commonly utilises the combined charging system (ccs) for dc rapid charging. to exchange important messages such as the state of charge (soc) with the electric vehicle supply equipment (evse) ccs uses a high-bandwidth ip link provided by the homeplug green phy (hpgp) power-line communication (plc) technology. the attack interrupts necessary control communication between the vehicle and charger, causing charging sessions to abort. the attack can be conducted wirelessly from a distance using electromagnetic interference, allowing individual vehicles or entire fleets to be disrupted simultaneously. in addition, the attack can be mounted with off-the-shelf radio hardware and minimal technical knowledge. with a power budget of 1 w, the attack is successful from around 47 m distance. the exploited behavior is a required part of the homeplug green phy, din 70121 & iso 15118 standards and all known implementations exhibit it. in addition to electric cars, brokenwire affects electric ships, airplanes and heavy duty vehicles utilising these standards."
        },
        "CVE-2021-22706": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22706",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22706",
            "Description": "A CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability exists in EVlink City (EVC1S22P4 / EVC1S7P4 all versions prior to R8 V3.4.0.1), EVlink Parking (EVW2 / EVF2 / EV.2 all versions prior to R8 V3.4.0.1), and EVlink Smart Wallbox (EVB1A all versions prior to R8 V3.4.0.1 ) that could allow an attacker to impersonate the user who manages the charging station or carry out actions on their behalf when crafted malicious parameters are submitted to the charging station web server."
        },
        "CVE-2021-22707": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22707",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22707",
            "Description": "A CWE-798: Use of Hard-coded Credentials vulnerability exists in EVlink City (EVC1S22P4 / EVC1S7P4 all versions prior to R8 V3.4.0.1), EVlink Parking (EVW2 / EVF2 / EV.2 all versions prior to R8 V3.4.0.1), and EVlink Smart Wallbox (EVB1A all versions prior to R8 V3.4.0.1 ) that could allow an attacker to issue unauthorized commands to the charging station web server with administrative privileges."
        },
        "CVE-2021-22721": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22721",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22721",
            "Description": "A CWE-200: Information Exposure vulnerability exists in EVlink City (EVC1S22P4 / EVC1S7P4 all versions prior to R8 V3.4.0.1), EVlink Parking (EVW2 / EVF2 / EV.2 all versions prior to R8 V3.4.0.1), and EVlink Smart Wallbox (EVB1A all versions prior to R8 V3.4.0.1 ) that could allow an attacker to get limited knowledge of javascript code when crafted malicious parameters are submitted to the charging station web server."
        },
        "CVE-2021-22723": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22723",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22723",
            "Description": "A CWE-79: Improper Neutralization of Input During Web Page Generation (Cross-siteScripting) through Cross-Site Request Forgery (CSRF) vulnerability exists in EVlink City (EVC1S22P4 / EVC1S7P4 all versions prior to R8 V3.4.0.1), EVlink Parking (EVW2 / EVF2 / EV.2 all versions prior to R8 V3.4.0.1), and EVlink Smart Wallbox (EVB1A all versions prior to R8 V3.4.0.1 ) that could allow an attacker to impersonate the user who manages the charging station or carry out actions on their behalf when crafted malicious parameters are submitted to the charging station web server."
        },
        "CVE-2021-22726": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22726",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22726",
            "Description": "A CWE-918: Server-Side Request Forgery (SSRF) vulnerability exists in EVlink City (EVC1S22P4 / EVC1S7P4 all versions prior to R8 V3.4.0.1), EVlink Parking (EVW2 / EVF2 / EV.2 all versions prior to R8 V3.4.0.1), and EVlink Smart Wallbox (EVB1A all versions prior to R8 V3.4.0.1 ) that could allow an attacker to perform unintended actions or access to data when crafted malicious parameters are submitted to the charging station web server."
        },
        "CVE-2021-22727": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22727",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22727",
            "Description": "A CWE-331: Insufficient Entropy vulnerability exists in EVlink City (EVC1S22P4 / EVC1S7P4 all versions prior to R8 V3.4.0.1), EVlink Parking (EVW2 / EVF2 / EV.2 all versions prior to R8 V3.4.0.1), and EVlink Smart Wallbox (EVB1A all versions prior to R8 V3.4.0.1 ) that could allow an attacker to gain unauthorized access to the charging station web server"
        },
        "CVE-2021-22729": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22729",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22729",
            "Description": "A CWE-259: Use of Hard-coded Password vulnerability exists in EVlink City (EVC1S22P4 / EVC1S7P4 all versions prior to R8 V3.4.0.1), EVlink Parking (EVW2 / EVF2 / EV.2 all versions prior to R8 V3.4.0.1), and EVlink Smart Wallbox (EVB1A all versions prior to R8 V3.4.0.1 ) that could allow an attacker to gain unauthorized administrative privileges when accessing to the charging station web server."
        },
        "CVE-2021-22730": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22730",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22730",
            "Description": "A CWE-798: Use of Hard-coded Credentials vulnerability exists in EVlink City (EVC1S22P4 / EVC1S7P4 all versions prior to R8 V3.4.0.1), EVlink Parking (EVW2 / EVF2 / EV.2 all versions prior to R8 V3.4.0.1), and EVlink Smart Wallbox (EVB1A all versions prior to R8 V3.4.0.1 ) that could an attacker to gain unauthorized administrative privileges when accessing to the charging station web server."
        },
        "CVE-2021-22773": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22773",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22773",
            "Description": "A CWE-620: Unverified Password Change vulnerability exists in EVlink City (EVC1S22P4 / EVC1S7P4 all versions prior to R8 V3.4.0.1), EVlink Parking (EVW2 / EVF2 / EV.2 all versions prior to R8 V3.4.0.1), and EVlink Smart Wallbox (EVB1A all versions prior to R8 V3.4.0.1 ) that could allow an attacker connected to the charging station web server to modify the password of a user."
        },
        "CVE-2021-22774": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22774",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22774",
            "Description": "A CWE-759: Use of a One-Way Hash without a Salt vulnerability exists in EVlink City (EVC1S22P4 / EVC1S7P4 all versions prior to R8 V3.4.0.1), EVlink Parking (EVW2 / EVF2 / EV.2 all versions prior to R8 V3.4.0.1), and EVlink Smart Wallbox (EVB1A all versions prior to R8 V3.4.0.1 ) that could lead an attacker to get knowledge of charging station user account credentials using dictionary attacks techniques."
        },
        "CVE-2021-22724": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22724",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22724",
            "Description": "A CVE-352 Cross-Site Request Forgery (CSRF) vulnerability exists that could allow an attacker to impersonate the user or carry out actions on their behalf when crafted malicious parameters are submitted in POST requests sent to the charging station web server. Affected Products: EVlink City EVC1S22P4 / EVC1S7P4 (All versions prior to R8 V3.4.0.2 ), EVlink Parking EVW2 / EVF2 / EVP2PE (All versions prior to R8 V3.4.0.2), and EVlink Smart Wallbox EVB1A (All versions prior to R8 V3.4.0.2)"
        },
        "CVE-2021-22725": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22725",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22725",
            "Description": "A CVE-352 Cross-Site Request Forgery (CSRF) vulnerability exists that could allow an attacker to impersonate the user or carry out actions on their behalf when crafted malicious parameters are submitted in POST requests sent to the charging station web server. Affected Products: EVlink City EVC1S22P4 / EVC1S7P4 (All versions prior to R8 V3.4.0.2 ), EVlink Parking EVW2 / EVF2 / EVP2PE (All versions prior to R8 V3.4.0.2), and EVlink Smart Wallbox EVB1A (All versions prior to R8 V3.4.0.2)"
        },
        "CVE-2021-22818": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22818",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22818",
            "Description": "A CWE-307 Improper Restriction of Excessive Authentication Attempts vulnerability exists that could allow an attacker to gain unauthorized access to the charging station web interface by performing brute force attacks. Affected Products: EVlink City EVC1S22P4 / EVC1S7P4 (All versions prior to R8 V3.4.0.2 ), EVlink Parking EVW2 / EVF2 / EVP2PE (All versions prior to R8 V3.4.0.2), and EVlink Smart Wallbox EVB1A (All versions prior to R8 V3.4.0.2)"
        },
        "CVE-2021-22821": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22821",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22821",
            "Description": "A CWE-918 Server-Side Request Forgery (SSRF) vulnerability exists that could cause the station web server to forward requests to unintended network targets when crafted malicious parameters are submitted to the charging station web server. Affected Products: EVlink City EVC1S22P4 / EVC1S7P4 (All versions prior to R8 V3.4.0.2 ), EVlink Parking EVW2 / EVF2 / EVP2PE (All versions prior to R8 V3.4.0.2), and EVlink Smart Wallbox EVB1A (All versions prior to R8 V3.4.0.2)"
        },
        "CVE-2021-22822": {
            "Date": "2021",
            "Source": "NVD",
            "Title": "CVE-2021-22822",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22822",
            "Description": "A CWE-79 Improper Neutralization of Input During Web Page Generation (�Cross-site Scripting�) vulnerability exists that could allow an attacker to impersonate the user who manages the charging station or carry out actions on their behalf when crafted malicious parameters are submitted to the charging station web server. Affected Products: EVlink City EVC1S22P4 / EVC1S7P4 (All versions prior to R8 V3.4.0.2 ), EVlink Parking EVW2 / EVF2 / EVP2PE (All versions prior to R8 V3.4.0.2), and EVlink Smart Wallbox EVB1A (All versions prior to R8 V3.4.0.2)"
        },
        "CVE-2020-8006": {
            "Date": "2020",
            "Source": "NVD",
            "Title": "CVE-2020-8006",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2020-8006",
            "Description": "The server in Circontrol Raption through 5.11.2 has a pre-authentication stack-based buffer overflow that can be exploited to gain run-time control of the device as root. The ocpp1.5 and pwrstudio binaries on the charging station do not use a number of common exploitation mitigations. In particular, there are no stack canaries and they do not use the Position Independent Executable (PIE) format."
        },
        "CVE-2024-43652": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43652",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43652",
            "Description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability allows OS Command Injection as root\nThis issue affects Iocharger firmware for AC model chargers before version 24120701\n\nLikelihood: Moderate – The <redacted> binary does not seem to be used by the web interface, so it might be more difficult to find. It seems to be largely the same binary as used by the Iocharger Pedestal charging station, however. The attacker will also need a (low privilege) account to gain access to the <redacted> binary, or convince a user with such access to execute a crafted HTTP request.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and delete\nfiles and services."
        },
        "CVE-2024-43658": {
            "Date": "2024",
            "Source": "NVD",
            "Title": "CVE-2024-43658",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2024-43658",
            "Description": "Patch traversal, External Control of File Name or Path vulnerability in  Iocharger Home allows deletion of arbitrary files\nThis issue affects Iocharger firmware for AC model before firmware version 25010801.\n\nLikelihood: High, but requires authentication\n\nImpact: Critical – The vulnerability can be used to delete any file on the charging station, severely impacting the integrity of the charging station. Furthermore, the vulnerability could be used to delete binaries required for the functioning of the charging station, severely impacting the availability of the charging station.\n\nCVSS clarification: Any network interface serving the web ui is vulnerable (AV:N) and there are not additional security measures to circumvent (AC:L), nor does the attack require and existing preconditions (AT:N). The attack is authenticated, but the level of authentication does not matter (PR:L), nor is any user interaction required (UI:N). The attack leads compromised of the integrity and availability of the device (VVC:N/VI:H/VA:H), with no effect on subsequent systems (SC:N/SI:N/SA:N). We do not forsee a safety impact (S:N). This attack can be automated (AU:Y)."
        },
        "CVE-2018-7778": {
            "Date": "2018",
            "Source": "MITRE",
            "Title": "CVE-2018-7778",
            "URL": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-7778",
            "Description": "in schneider electric evlink charging station versions prior to v3.2.0-12_v1, the web interface has an issue that may allow a remote attacker to gain administrative privileges without properly authenticating remote users."
        },
        "CVE-2011-5145": {
            "Date": "2011",
            "Source": "NVD",
            "Title": "CVE-2011-5145",
            "URL": "https://nvd.nist.gov/vuln/detail/CVE-2011-5145",
            "Description": "Multiple SQL injection vulnerabilities in Open Business Management (OBM) 2.4.0-rc13 and probably earlier allow remote authenticated users to execute arbitrary SQL commands via the (1) sel_domain_id or (2) action parameter to obm.php; (3) tf_user parameter in a search action to group/group_index.php; (4) tf_delegation, (5) tf_ip, (6) tf_name to host/host_index.php; or (7) lang, (8) theme, (9) cal_alert, (10) cal_first_hour, (11) cal_interval, (12) cal_last_hour, (13) commentorder, (14) csv_sep, (15) date, (16) date_upd, (17) debug_exe, (18) debug_id, (19) debug_param, (20) debug_sess, (21) debug_solr, (22) debug_sql, (23) dsrc, (24) menu, (25) rows, (26) sel_display_days, (27) timeformat, (28) timezone, or (29) todo parameter to settings/settings_index.php."
        }
    }
}